# Reference: https://github.com/Homebrew/homebrew-bundle

# A better Terminal
cask "ghostty"

# Prerequisite, but good to just make sure its there
brew "git"
brew "git-filter-repo" # extension used for things like removing large files from history

# Prefered credential manager on macOS for GitHub
cask "git-credential-manager"

# Open and/or free fonts
cask "font-fira-code"
cask "font-monaspace" # https://monaspace.githubnext.com/

# Replacement for cat and man, supporting colorized syntax highlighting
brew "bat"
tap "eth-p/software"
  brew "bat-extras-batman"

# Disk usage visualization utility
brew "ncdu"

# Modern web server, but mostly just used for static file serving
# https://caddyserver.com/docs/command-line
brew "caddy"

# Modern Python - symlinks for python3 and pip3 will invoke this version
# https://docs.brew.sh/Homebrew-and-Python
brew "python@3.12"

# fzf - Fuzzy Finder
brew "fzf"
brew "tree" # used to preview directories, and a generally useful utility

# 1Password CLI
tap "1Password/tap"
  cask "1password-cli"

# fnm - Fast Node Manager (replacement for nvm)
brew "fnm"

# Deno
brew "deno"

# Rust
brew "rustup"

# Go (golang)
# We can use the go@{version} notation if we care about a fixed version.
brew "go"

# Exiftool - used by digiKam and RawTherapee (photography workflow)
brew "exiftool"

# Media tools
brew "ffmpeg" # dependency for merging fragments and tracks
brew "bento4" # package that contains mp4decrypt
brew "yt-dlp" # fork of Youtube-DL with more features and built on modern Python
# MakeMVK is used to convert ripped DVD images and discs into MKV files without transcoding the media
# It is free while in beta. The current key is found here: https://forum.makemkv.com/forum/viewtopic.php?t=1053
# On macOS, you make need to right-click the app in /Applications and select Open, then select Open in the warning
# since it is not signed by Apple.
cask "makemkv"
