# Reference: https://github.com/Homebrew/homebrew-bundle

# Prerequisite, but good to just make sure its there
brew "git"

tap "microsoft/git"
# Prefered credential manager on macOS for GitHub
cask "git-credential-manager-core"

# Open and/or free fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"

# Replacement for cat and man, supporting colorized syntax highlighting
brew "bat"
tap "eth-p/software"
brew "bat-extras-batman"

# Modern web server, but mostly just used for static file serving
# https://caddyserver.com/docs/command-line
brew "caddy"

# Modern Python - symlinks for python3 and pip3 will invoke this version
# https://docs.brew.sh/Homebrew-and-Python
brew "python@3.11"

# fzf - Fuzzy Finder
brew "fzf"
brew "tree" # used to preview directories, and a generally useful utility

# 1Password CLI
tap "1Password/tap"
cask "1password-cli"

# fnm - Fast Node Manager (replacement for nvm)
brew "fnm"

# Deno
brew "deno"

# Rust
brew "rustup"

# Go (golang)
# We can use the go@{version} notation if we care about a fixed version.
brew "go"

# Exiftool - used by digiKam and RawTherapee (photography workflow)
brew "exiftool"

# Youtube-DLP - fork of Youtube-DL with more features and built on modern Python
brew "ffmpeg" # dependency for merging fragments and tracks
brew "yt-dlp"
